doneadd = "៛ تم تفعيل المجموعة ([{}])"

doneadd2 = "៛ تم تفعيل المجموعة ([{}])"

doneadded = "៛ المجموعة ([{}]) مفعلة"

disabled = "៛ المجموعة ([{}]) معطلة"

disabl = "៛ تم تعطيل المجموعة ([{}])"


userNocc = "៛ عذراً لايمكنني الوصول الى (الايدي , المعرف)"

locked = """៛ بواسطه ⌁ {} 
៛ {} بالفعل مقفوله في المجموعة"""
lock = """៛ بواسطه ⌁ {} 
៛ تم قفل {} في المجموعة"""

unlocked = """៛ بواسطه ⌁ {} 
៛ {} بالفعل مفتوحه في المجموعة"""
unlock = """៛ بواسطه ⌁ {} 
៛ تم فتح {} في المجموعة"""
kickbotadd = "تم طرد البوت <a href='http://t.me/{}'>{}</a>"

ADDed = """៛ بواسطه ⌁ {} 
៛ {} بالفعل مفعله في المجموعة"""
ADD = """៛ بواسطه ⌁ {} 
៛ تم تفعيل {} في المجموعة"""

unADDed = """៛ بواسطه ⌁ {} 
៛ {} بالفعل معطله في المجموعة"""
unADD = """៛ بواسطه ⌁ {} 
៛ تم تعطيل {} في المجموعة"""

true = "✅"

false = "❎"

settings = """៛ اعدادات المجموعة
✅ مفتوحه | ❎ مقفوله"""

st2 = """៛ اعدادات المجموعة
✅ مفعله | ❎ معطله
៛ وقت التكرار : (<b>{}</b>)
៛ عدد التكرار : (<b>{}</b>)"""



notforyou = "៛ عذراً الامر ليس لك"

Corder = "៛ الغاء الامر"

doneCO = "៛ تم الغاء الامر"
ARdoneCO = "៛ بالفعل تم الغاء الامر"

setRK = """៛ العضو : {}
៛ تم رفعه {}"""
remRK = """៛ العضو : {}
៛ تم تنزيله من ال{}"""

DsetRK = """៛ العضو : {}
៛ بالفعل {}"""
DremRK = """៛ العضو : {}
៛ ليس {}"""

ban = """៛ العضو : {}
៛ تم حظره من المجموعة"""
Dban = """៛ العضو : {}
៛ بالفعل محظور من المجموعة"""

banall = """៛ العضو : {}
៛ تم حظره في المجموعات"""
Dbanall = """៛ العضو : {}
៛ بالفعل محظور بالمجموعات"""

unban = """៛ العضو : {}
៛ تم الغاء حظره من المجموعة"""
Dunban = """៛ العضو : {}
៛ بالفعل غير محظور من المجموعة"""

unbanall = """៛ العضو : {}
៛ تم الغاء حظره في المجموعات"""
Dunbanall = """៛ العضو : {}
៛ بالفعل غير محظور بالمجموعات"""

restricted = """៛ العضو : {}
៛ تم تقيد من المجموعة"""
Drestricted = """៛ العضو : {}
៛ بالفعل مقيد من المجموعة"""

unrestricted = """៛ العضو : {}
៛ تم الغاء تقيد من المجموعة"""
Dunrestricted = """៛ العضو : {}
៛ بالفعل غير مقيد من المجموعة"""

restrictedall = """៛ العضو : {}
៛ تم تقيد في المجموعات"""
Drestrictedall = """៛ العضو : {}
៛ بالفعل مقيد بالمجموعات"""

unrestrictedall = """៛ العضو : {}
៛ تم الغاء تقيد في المجموعات"""
Dunrestrictedall = """៛ العضو : {}
៛ بالفعل غير مقيد بالمجموعات"""

haveRank = "៛ لا يمكنك <حظر ـ طرد ـ كتم ـ تقيد> الـ{}"
haveKick = "៛ عذراً العضو مطرود او غير موجود بالمجموعة"
delList = "៛ مسح {}"

TKflood = """៛ العضو : {}
៛ تم تقيده لتجاوز عدد الرسائل المحدده {} في الوقت المحدد {}"""

DoneSet = "៛ تم وضع {} {}"


haveRc = """៛ العضو : {}
៛ بالفعل مقيد"""

showlist = "៛ قائمة {} :\n{}"
listempty = "៛ قائمة {} فارغة"
creatorempty = "៛ عذراً لا يوجد منشئ"
listempty2 = "៛ القائمة فارغة"
Doneblock = "៛ تم منع ({}) في المجموعة ({})"
Adoneblock = "៛({}) بالفعل ممنوعة في المجموعة"


StB = "៛ تم منع الملصق في المجموعة ({})"
StA = "៛ الملصق بالفعل ممنوع في المجموعة ({})"

GfB = "៛ تم منع المتحركه في المجموعة ({})"
GfA = "៛ المتحركه بالفعل ممنوعة في المجموعة ({})"

PhB = "៛ تم منع الصورة في المجموعة ({})"
PhA = "៛ الصورة بالفعل ممنوعة في المجموعة ({})"


unDoneblock = "៛ تم الغاء منع ({}) في المجموعة ({})"
unAdoneblock = "៛({}) بالفعل غير ممنوعة في المجموعة"

unStB = "៛ تم الغا منع الملصق في المجموعة ({})"
unStA = "៛ الملصق بالفعل غير ممنوع في المجموعة ({})"

unGfB = "៛ تم الغاء منع المتحركه في المجموعة ({})"
unGfA = "៛ المتحركه بالفعل غير ممنوعة في المجموعة ({})"

unPhB = "៛ تم الغاء منع الصورة في المجموعة ({})"
unPhA = "៛ الصورة بالفعل غير ممنوعة في المجموعة ({})"
blocklist = "៛ {} قوائم الخاصه بالمجموعة {}"
banlist = "៛ قوائم العام الخاصه بالبوت"


blocklist2 = "المنع"
replylist = "الردود"
replylistBot = "ردود البوت"
BlocklistRm = "مسح الكلمات الممنوعة"
replylistRm = "مسح ردود الكلمات"
STreplylistRm = "مسح ردود الملصقات"
VOreplylistRm = "مسح ردود الصوتيات"
GFreplylistRm = "مسح ردود المتحركات"

BlocklistEm = "៛ قائمة الكلمات الممنوعة فارغة"
replylistEm = "៛ قائمة الكلمات فارغة"
STreplylistEm = "៛ قائمة الملصقات فارغة"
GFreplylistEm = "៛ قائمة المتحركات فارغة"
VOreplylistEm = "៛ قائمة الصوتيات فارغة"

Blocklistone = "الغاء منع"
Delall = "៛ يمكنك مسح القائمة بالضغط على 🔽"
Delall2 = "الغاء منع الكل"
DoneUNblock = "تم الغاء المنع"

DelallR = "៛ يمكنك مسح الردود بالضغط على 🔽"
Delall2R= "مسح الكل"

Donewel = "៛ تم تغير الترحيب الى {}"

Sendreply = """៛ الان ارسل الرد الذي تريد وضعة لـ %s
يمكنك استخدام الـhtml ويمكنك ايضا :

<b>{fn}</b> : لعرض الاسم
<b>{username}</b> : لعرض المعرف
<b>{id}</b> : لعرض الايدي
<b>{stast}</b> : لعرض الموقع
<b>{cn}</b> : لعرض اسم المجموعة"""

SRtext = "៛ تم حفظ الرد الخاص بـ({})"
SRst = "៛ تم حفظ الملصق الخاص بـ({})"
SRgf = "៛ تم حفظ المتحركه الخاصه بـ({})"
SRvo = "៛ تم حفظ البصمه الخاصه بـ({})"

Drp = "៛ تم حذف الرد الخاص بـ({})"
Norp = "៛ لا يوجد رد خاص بـ({})"
Yrp = "៛ عذراً يوجد رد خاص بـ({})"
allbandel = "مسح المحظورين عام"

alltkdel = "مسح المكتومين عام"

allbanE = "៛ قائمة المحظورين عام فارغة"

alltkE = "៛ قائمة المكتومين عام فارغة"

Ddelbanall = "៛ تم حذف قائمة المحظورين عام"

Ddeltkall = "៛ تم حذف قائمة المكتومين عام"

Dsetname = "៛ تم تغير اسم المجموعة الى {}"
Dsetabout = "៛ تم تغير وصف المجموعة الى {}"

Dsetphoto = "៛ تم تغير صورة المجموعة"
Dsetlk = """៛ تم تغير رابط المجموعة الى :
{}"""
yourmsgs = "៛ رسائلك (<b>{}</b>)"
youredits = "៛ سحكاتك (<b>{}</b>)"

youraddcontact = """៛ جهاتك (<b>{}</b>)
៛ تم حذف عدد جهاتك"""

yes = "نعم"
no = "لا"
kickme = "<b>هل انت متاكد؟</b>"
Dkickme = "៛ تم طردك بأرادتك"
Nkickme = "៛ تم الغاء الامر"

Rsudo = "مطور اساسي"
Rasudo = "مطور اساسي ثانوي"
Rsudos = "مطور"
Rmalk = "مالك الجروب"
Racreator = "منشئ اساسي الجروب"
Rmalk = "مالك"
Rcreator = "منشئ اساسي"
Rcreator = "منشئ الجروب"
Rowner = "مدير الجروب"
Radmin = "ادمن"
Rvip = "عضو مميز"
Rmember = "عضو"

Rrank = "رتبتك : {}"
Rmsgs = "رسائلك : ({})"
Rrate = "تفاعلك : ({})"
Redits = "سحكاتك : ({})"
RID = "ايديك : {}"
RIDPH = "اسمك : {}\n ايديك : {}"
RIDPHs = "៛ اضغط لأظهار معلوماتك"
DPROadmins = "៛ تم رفع ادمنية المجموعة في البوت"
DsetSudosShow = "៛ تم تغير كليشه المطور"

DsetSudosShowE = "៛ عذراً توجد مشكلة في html الرسالة"



sendto = "៛ اين تريد ارسالها؟"

Dpinmsg = "៛ تم تثبيت الرسالة"
Dunpinmsg = "៛ تم الغاء تثبيت الرسالة"

showstats = """៛ احصائيات البوت :

៛ عدد المجموعات : <b>{}</b>
៛ عدد المحادثات : <b>{}</b>"""

showGPlk = "៛ رابط المجموعة : \n {}"

PRsendtoGP = "៛ يتم الان ارسال الرسالة الى المجموعات"

PRsendtoPR = "៛ يتم الان ارسال الرسالة الى المحادثات"

DsendtoGP = """៛ تم ارسال الرسالة الى المجموعات
✔️꒐ تم ارسالها الى : <b>{}</b>
✖️꒐ لم يتم ارسالها الى : <b>{}</b>"""
DsendtoPR = """៛ تم ارسال الرسالة الى المحادثات
✔️꒐ تم ارسالها الى : <b>{}</b>
✖️꒐ لم يتم ارسالها الى : <b>{}</b>"""


clickTOpv = "៛ عرض بالمحادثة"
 
Toolong = "៛ عذراً الرسالة طويلة اضغظ على الزر لعرضها في محادثه البوت"

DoneDelList = "៛ تم مسح القائمة"
SetAuto = "៛ تم وضع عدد التفعيل التلقائي  (<b>{}</b>)"

NoMember = "៛ عذراً العضو غير موجود بالمجموعة"

cTsudo = "៛ لا يمكنك (حظر عام/كتم عام) مطور"

Toolow = "៛ عذراً عدد الجروب اقل من (<b>{}</b>)"

GiveMEall = "៛ عذرا لايمكنني تفعيل المجموعة رجاءا امنحني كل خواص الادمن"

DoneleaveChat = "៛ تم المغادره من المجموعة"


banclick = """៛ العضو : {}
៛ تم حظرك من استخدام الازرار لمدة دقيقتين بسبب تكرارك"""

NoDeleted =  "៛ عذراً لا يوجد حسابات محذوفه في المجموعة"
LenDeleted = "៛ يوجد {} حساب محذوف سيتم طردهم من المجموعة"


AdminO = """ـ قائمة الادمنية :

ـ حظر ⇠ < معرف، رد، ايدي >
ـ تقيد⇠< معرف، رد، ايدي >
ـ المقيدون - المكتومين - المحظورين

ـ الاعدادات ⇠ (بالتقيد)
⎯ ⎯ ⎯ ⎯"""

OwnerO = """ـ قائمة المدراء :-

ـ (رفع، تنزيل) ⇠ ادمن <معرف، بالرد، ايدي>
ـ (رفع، تنزيل) ⇠ مميز <معرف، بالرد، ايدي>
ـ تنزيل الكل ⇠ <معرف، بالرد، ايدي>

ـ (الادمنية، المميزين)

ـ (الغاء، منع) ⇠ <بالرد، جملة>
ـ (اضف، حذف) ⇠ رد ⇠ <جملة>
ـ قائمة ⇠ (الردود، المنع)

ـ وضع ترحيب ⇠ <جملة>
ـ (عدد، وقت) التكرار <عدد>
ـ وضع التحقق
ـ وضع التكرار
ـ تعين الايدي ⇠ <جملة>
ـ تنظيف ⇠ <العدد>
ـ مسح الايدي

ـ (تفعيل، تعطيل) :
ـ الترحيب
ـ التكرار 
ـ الردود
ـ التحقق
ـ ردود البوت
ـ اطردني
ـ الايدي
ـ الايدي بالصورة
ـ الايدي بالازرار
⎯ ⎯ ⎯ ⎯"""

CreatorO = """ـ قائمة المنشئ :

ـ (رفع، تنزيل)⇠ مدير ⇠ <معرف، بالرد، ايدي>
ـ (تفعيل، تعطيل) ⇠ <التثبيت>

ـ مسح ⇠ <المحذوفين، البوتات>
⎯ ⎯ ⎯ ⎯"""

SudosO = """ـ اوامر المطورين :

ـ (تفعيل، تعطيل) ⇠ المجموعة
ـ (رفع، تنزيل) ⇠ منشئ ⇠ <معرف، بالرد، ايدي>

ـ (اضف، حذف) ⇠ للبوت ⇠ <جملة>
ـ قائمة ردود البوت
⎯ ⎯ ⎯ ⎯"""

SudoO = """ـ اوامر المطور الاساسي :

(رفع، تنزيل) ⇠ مطور ⇠ <معرف، بالرد، ايدي>
ـ (حظر، كتم) ⇠ عام ⇠ <معرف، بالرد، ايدي>
ـ الغاء (حظر، كتم) ⇠ العام ⇠ <معرف، بالرد، ايدي>
ـ (قوائم العام، المطورين>

ـ (اذاعه، توجيه) ⇠ <بالرد>
ـ مغادرة ⇠ <ايدي المجموعة>
ـ (المجموعات، روابط المجموعات)

ـ وضع امر المطور ⇠ <كليشه>
ـ (تفعيل، تعطيل) ⇠ <التلقائي>
ـ عدد التلقائي ⇠ <عدد>

ـ تحديث ⇠ <البوت، اللغات>
ـ (اضف، حذف) ⇠ ملف
ـ الملفات
⎯ ⎯ ⎯ ⎯"""

Showall = """اهلا بك في بوت <a href=\"t.me/wzsss\">WiZArD</a>
يمكنك استخدام هذه الاوامر 🔽"""

LockO = """اوامر القفل والفتح :

ـ ( قفل، فتح ) :
ـ الروابط
ـ البوتات
ـ الفيديو
ـ الملاحظه
ـ الاغاني
ـ الصوت
ـ المتحركه
ـ الصور 
ـ الانلاين
ـ الماركدون
ـ الجهات
ـ الملفات
ـ الملصقات
ـ التوجيه
ـ المعرف
ـ الانكليزيه
ـ العربيه
ـ التاك
ـ الاشعارات
ـ التعديل
ـ الكلايش

ـ ملاحظه : انصح بأستخدام امر (الاعدادات) للسهولة.
⎯ ⎯ ⎯ ⎯"""

lockC = "اوامر القفل"
AdminC = "اوامر الادمن"
OwnerC = "اوامر المدير"
CreatorC = "اوامر المنشئ"
SudosC = "اوامر المطور"
SudoC = "اوامر المطور الاساسي"


ShowGPN = "{}- الاسم : ({})\nالايدي : (`{}`)"

AsPh = '''💬 {}
📊 {}
📇 {}'''


Dulang = "៛ تم تحديث لغات البوت"

SudoOnle = "៛ عذراً الامر للمطور الاساسي"

Chlang = """🇮🇶꒐ اختر اللغه
🇺🇸꒐ Choose the language"""


lang ={"ar":"🇮🇶 AR-Classic","en":"🇺🇸EN","arem":"🇮🇶 AR-Emoji"}


IDnPT = '''⌔︙ID : {id} .
⌔︙User : {username} .
⌔︙Stast : {stast} .
⌔︙Msgs : {msgs} .
⌔︙Edits : {edits} .
⌔︙Rate : {rate} .
⌔︙Age : {age} .
⎯ ⎯ ⎯ ⎯'''


DsetIDShow = "៛ تم تغير كليشه الايدي"
Ddelid = "៛ تم مسح كليشه الايدي سيتم عرض الاساسية"

NoBots= "៛ عذراً لا يوجد بوتات في المجموعة"
LenBots = "៛ يوجد {} بوت سيتم طردهم من المجموعة"

Wres = "៛ سيتم اعادة تشغيل البوت الرجاء الانتظار"


MoreInfo = "៛ معرفه المزيد؟"

CKgps = "فحص المجموعات"

Dckg = "\n៛ تم فحص المجموعات وتم حذف {}"

ckpr = "៛ يتم الان فحص المجموعات قد يستغرق القليل من الوقت"

true2 = "✔️"
false2 = "✖️"

settingsRes = """៛ اعدادات التقيد بالمجموعة
✔️꒐ مفتوحه | ✖️꒐ مقفوله"""

pk = "⏪"
fr = "⏩"
hide = "اخفاء"

sors = "البوت [{}] من سورس [WiZArD](t.me/wzsss)"

dellink = "رابط حذف حساب التلكرام 🔽"




botstart = """<b>اهلا بك في {} بوت حماية المجموعات</b>
<b>يمكنك اضافتي</b> <a href=\"http://t.me/{}?startgroup=botstart\">بالضغط هنا</a>
<b>⎯ ⎯ ⎯ ⎯</b>"""

Tban = "حظر"
Tres = "تقيد"

fset = "وضع التكرار : {}"
Tfset = "៛ يمكنك تغير وضع التكرار الى ( تقيد | حظر )"

NOaddfiles = "៛ عذراً لا توجد ملفات من <a href=\"http://t.me/wzsss\">(WiZArD)</a>"

NOaddfiles2 = """៛ عذراً لاتوجد ملفات في البوت يمكنك اضافه ملفات عن طريق ارسال اضف ملف"""

addFiles = """៛ اليك الملفات المتوفره من <a href=\"http://t.me/wzsss\">(WiZArD)</a>
៛ يمكنك تحميل الملف بالضغط علي اسم الملف"""

Dua = """✔️꒐ تم (تحميل/تحديث) الملف ({})
៛ يمكنك تفعيله عن طريق ارسال الملفات"""

Files = """៛ اليك الملفات الموجودة في البوت 
៛ يمكنك تفعيل وتعطيل الملف بالضغط"""

dlFiles = """៛ اليك الملفات الموجودة في البوت 
៛ يمكنك حذف الملف بالضغط"""


Delfile = "✔️꒐ تم حذف االملف ({})"
Delfiles = "✔️꒐ تم حذف جميع الملفات"

remall = """៛ العضو : {} 
៛ تم تنزيله من ({})"""

remallN = """៛ العضو : {} 
៛ ليس لديه رتب"""


RKgp = "المجموعات"
RKgpl = "روابط المجموعات"
RKaf = "اضف ملف"
RKrf = "حذف ملف"
RKf = "الملفات"
RKub = "تحديث البوت"
RKul = "تحديث اللغات"
sudostart = """៛ أهلاً بك ، المطور الاساسي
៛ يمكنك استخدام الاوامر التي ظهرت لك"""


Lenbans= "៛ يوجد {} محظور سيتم الغاء حظرهم"
NobansC = "៛ عذراً لا يوجد محظورين في المجموعة"

Lenrks= "៛ يوجد {} مقيد سيتم الغاء تقيدهم"
NorksC = "៛ عذراً لا يوجد مقيدين في المجموعة"

addor = "៛ ({}) اضافته الى ؟"
Daddor = "៛ تم اضافه ({}) الى ({})"
SRph = "៛ تم حفظ الصورة الخاصه بـ({})"
SRfi = "៛ تم حفظ الملف الخاصه بـ({})"

checkmem = """៛ عذراً {} يجب علينا التأكد أنك لست روبوت
៛ اضغط نعم لأكمال التحقق
⎯ ⎯ ⎯ ⎯"""
checkmem2 = """៛ عذراً {} يجب علينا التأكد أنك لست روبوت
៛ اختر الاجابة الصحيحة لحل المعادلة
{}
⎯ ⎯ ⎯ ⎯"""
certain = "متأكد"
notcertain = "لست متأكد"
ucertain = "៛ هل انت متأكد؟"
bancheck = """៛ تم حظر {}، فشل بالتحقق"""

age = {"older_than":"أقدم من","newer_than":"أحدث من","aprox":"~"}


tset = "وضع التحقق : {}"
Ttset = "៛ يمكنك تغير وضع التحقق الى ( معادلات | خطوتين )"
Teq = "معادلات"
Ttwo = "خطوتين"

ReIDnPT = """⌔︙ID : {(ReID}) .
⌔︙User : ({Reus}) .
⌔︙Stast : ({Rerank}) .
⌔︙Msgs : ({Remsgs}) .
⌔︙Edits : ({Reedits}) .
⌔︙Rate : ({Rerate}) .
⌔︙Age : ({Rage}) .
⎯ ⎯ ⎯ ⎯"""

IDnPT = '''⌔︙ID : {id} .
⌔︙User : {username} .
⌔︙Stast : {stast} .
⌔︙Msgs : {msgs} .
⌔︙Edits : {edits} .
⌔︙Rate : {rate} .
⌔︙Age : {age} .
⎯ ⎯ ⎯ ⎯'''

Rage = "الانشاء : {}"

OwnerO = """ـ قائمة المدراء :-

ـ (رفع، تنزيل) ⇠ ادمن <معرف، بالرد، ايدي>
ـ (رفع، تنزيل) ⇠ مميز <معرف، بالرد، ايدي>
ـ تنزيل الكل ⇠ <معرف، بالرد، ايدي>

ـ (الادمنية، المميزين)

ـ (الغاء، منع) ⇠ <بالرد، جملة>
ـ (اضف، حذف) ⇠ رد ⇠ <جملة>
ـ قائمة ⇠ (الردود، المنع)

ـ وضع ترحيب ⇠ <جملة>
ـ عدد التكرار <عدد>
ـ وضع التحقق
ـ وضع التكرار
ـ تعين الايدي ⇠ <جملة>
ـ تنظيف ⇠ <العدد>
ـ مسح الايدي

ـ (تفعيل، تعطيل) :
ـ الترحيب
ـ التكرار 
ـ الردود
ـ التحقق
ـ ردود البوت
ـ اطردني
ـ الايدي
ـ الايدي بالصورة
ـ الايدي بالازرار
⎯ ⎯ ⎯ ⎯"""


prGPadmin = """៛ العضو : {} 
៛ تم رفعه ادمن في المجموعة"""

gpinfo = """اسم المجموعة ៛: {}
عدد الاعضاء ៛: {}
عدد الادمنية ៛: {}
عدد المطرودين ៛: {}
عدد المحظورين ៛: {}
عدد رسائل الجروب ៛: {}
⎯ ⎯ ⎯ ⎯"""
